JWXL19733/WeGui_RGB/CW32L012/资料/CW32L012_StandardPeripheralLib_V1.0.1/Examples/DIGITALSIGN/DigitalSign/USER/src/main.c
/**
 * @file main.c
 * @author WHXY
 * @brief
 * @version 0.1
 * @date 2022-7-12
 *
 * @copyright Copyright (c) 2021
 *
 */
/*******************************************************************************
*
* 代码许可和免责信息
* 武汉芯源半导体有限公司授予您使用所有编程代码示例的非专属的版权许可，您可以由此
* 生成根据您的特定需要而定制的相似功能。根据不能被排除的任何法定保证，武汉芯源半
* 导体有限公司及其程序开发商和供应商对程序或技术支持（如果有）不提供任何明示或暗
* 含的保证或条件，包括但不限于暗含的有关适销性、适用于某种特定用途和非侵权的保证
* 或条件。
* 无论何种情形，武汉芯源半导体有限公司及其程序开发商或供应商均不对下列各项负责，
* 即使被告知其发生的可能性时，也是如此：数据的丢失或损坏；直接的、特别的、附带的
* 或间接的损害，或任何后果性经济损害；或利润、业务、收入、商誉或预期可节省金额的
* 损失。
* 某些司法辖区不允许对直接的、附带的或后果性的损害有任何的排除或限制，因此某些或
* 全部上述排除或限制可能并不适用于您。
*
*******************************************************************************/
/******************************************************************************
 * Include files
 ******************************************************************************/
#include "..\inc\main.h"
#include "cw32l012_sysctrl.h"
#include "cw32l012_digitalsign.h"
#include "cw32l012_gpio.h"
#include "cw32l012_systick.h"

/******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/
//extern LED_InitTypeDef LED1 , LED2;
/******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/


/******************************************************************************
 * Local variable definitions ('static')                                      *
 ******************************************************************************/

/******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*****************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
uint8_t Chip_Type[24];
uint8_t Pin_Count;
uint32_t Flash_Size;
uint16_t Ram_Size;
uint8_t Chip_Uid[10];

/**
 ******************************************************************************
 ** \brief  Main function of project
 **
 ** \return uint32_t return value, if needed
 **
 ** This sample toggle GPIOA.00
 **
 ******************************************************************************/
int32_t main(void)
{
    uint8_t i;
    Bsp_Init(4000000);
    InitTick(4000000);

    DIGITALSIGN_GetChipType(Chip_Type);
    Pin_Count = DIGITALSIGN_GetPinCount();
    Flash_Size = DIGITALSIGN_GetFlashSize();
    Ram_Size = DIGITALSIGN_GetRamSize();
    DIGITALSIGN_GetChipUid(Chip_Uid);      //UID地址

    printf("The chip Type is %s\r\n", Chip_Type);
    printf("The chip has %d pins\r\n", Pin_Count);
    printf("The chip provides %d bytes FLASH\r\n",  Flash_Size);
    printf("The chip provides %d bytes SRAM\r\n", Ram_Size);
    printf("The chip UUID is");
    for (i = 0; i < 10; i++)
    {
        printf(" 0x%02X", Chip_Uid[i]);
    }
    printf("\r\n");

    while (1)
    {
        Bsp_Led_Tog(&LED1);
        SysTickDelay(1000);
    }

}


/******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
    /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
       tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
    /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

